Autodesk.Revit.DB.Structure.AnalyticalLink.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a new instance of a AnalyticalLink element between two Hubs.
doc:
Document to which new AnalyticalLink should be added.
type:
AnalyticalLinkType for the new AnalyticalLink.
startHubId:
Hub at start of AnalyticalLink.
endHubId:
Hub at end of AnalyticalLink.
Returns:
The newly created AnalyticalLink instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
startHubId is not a valid Hub ID for an AnalyticalLink element.
-or-
endHubId is not a valid Hub ID for an AnalyticalLink element.
-or-
Thrown if startHubId or endHubId do not represent ids of Hubs.
-or-
Thrown if startHubId == endHubId.
-or-
Thrown if type does not represent an id of an AnalyticalLinkType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013